# 1. Використовуємо офіційний, максимально легкий образ Node.js на базі Alpine Linux
FROM node:20-alpine

# 2. Встановлюємо робочу директорію всередині контейнера
WORKDIR /usr/src/app

# 3. Спочатку копіюємо ТІЛЬКИ файли з переліком залежностей
COPY package*.json ./

# 4. Встановлюємо всі бібліотеки (express, multer, mysql2 тощо)
RUN npm install

# 5. Копіюємо весь інший код нашого проєкту (окрім того, що в .dockerignore)
COPY . .

# 6. Створюємо папку uploads всередині контейнера, щоб Multer не видав помилку
RUN mkdir -p uploads

# 7. Відкриваємо порт 3000 назовні
EXPOSE 3000

# 8. Команда, яка виконається під час старту контейнера
CMD ["node", "server.js"]